***** preferred sequence for loading apollo and other incarnation samples
:PROPERTIES:
:ID:       62220D41-AE0A-4D5F-B2D6-6B100610A89B
:END:
#+BEGIN_SRC clojure :results silent

(def path-to-sounds "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/")
(def path-to-mono (str path-to-sounds "sounds/all-mono/"))
#+END_SRC



#+RESULTS:
: #'user/variation1#'user/variation2#'user/apotheose#'user/calliope#'user/coda#'user/yancey#'user/naissance#'user/pas-daction#'user/pas-deux#'user/polymnie#'user/terpsichore#'user/goldberg-slow#'user/irma


***** buffer id
#+BEGIN_SRC clojure 
(buffer-id variation1)
(buffer-id variation2)
(buffer-id apotheose)
(buffer-id calliope)
(buffer-id coda)
(buffer-id yancey)
(buffer-id naissance)
(buffer-id pas-daction)
(buffer-id pas-deux)
(buffer-id polymnie)
(buffer-id terpsichore)
(buffer-id goldberg-slow)
(buffer-id irma)
#+END_SRC

#+RESULTS:
: 123456789101112


***** [#A] full info
#+BEGIN_SRC clojure :results output
(for [name [variation1 variation2 apotheose calliope coda yancey naissance pas-daction pas-deux polymnie terpsichore goldberg-slow irma]]
(do  (pprint name) (println)))
#+END_SRC

#+RESULTS:
#+begin_example
{:id 1,
 :size 7658496,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4bd2aa6c: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apollo-variation1-mono.wav",
 :args {},
 :name "apollo-variation1-mono.wav",
 :rate-scale 1.0,
 :duration 173.66204081632654,
 :n-samples 7658496}

{:id 2,
 :size 7216896,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@608be141: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apollo-variation2-mono.wav",
 :args {},
 :name "apollo-variation2-mono.wav",
 :rate-scale 1.0,
 :duration 163.64843537414967,
 :n-samples 7216896}

{:id 3,
 :size 8620032,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4d530c8a: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apotheose-mono.wav",
 :args {},
 :name "apotheose-mono.wav",
 :rate-scale 1.0,
 :duration 195.4655782312925,
 :n-samples 8620032}

{:id 4,
 :size 4876288,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@142fc985: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/calliope-mono.wav",
 :args {},
 :name "calliope-mono.wav",
 :rate-scale 1.0,
 :duration 110.57342403628118,
 :n-samples 4876288}

{:id 5,
 :size 7805824,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@3ad9b505: :live>,
 :path "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/coda-mono.wav",
 :args {},
 :name "coda-mono.wav",
 :rate-scale 1.0,
 :duration 177.0028117913832,
 :n-samples 7805824}

{:id 6,
 :size 12036573,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@135beb7c: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/how-long-slowest-mono.wav",
 :args {},
 :name "how-long-slowest-mono.wav",
 :rate-scale 1.0,
 :duration 272.9381632653061,
 :n-samples 12036573}

{:id 7,
 :size 12697600,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@57f1c1d: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/naissance-mono.wav",
 :args {},
 :name "naissance-mono.wav",
 :rate-scale 1.0,
 :duration 287.9274376417234,
 :n-samples 12697600}

{:id 8,
 :size 12649472,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@34c40340: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/pas-daction-real-mono.wav",
 :args {},
 :name "pas-daction-real-mono.wav",
 :rate-scale 1.0,
 :duration 286.8360997732426,
 :n-samples 12649472}

{:id 9,
 :size 10633344,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@1216892f: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/pas-de-deux-mono1.wav",
 :args {},
 :name "pas-de-deux-mono1.wav",
 :rate-scale 1.0,
 :duration 241.11891156462585,
 :n-samples 10633344}

{:id 10,
 :size 3202816,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@1e768dc8: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/polymnie-mono.wav",
 :args {},
 :name "polymnie-mono.wav",
 :rate-scale 1.0,
 :duration 72.62621315192743,
 :n-samples 3202816}

{:id 11,
 :size 5381632,
 :n-channels 2,
 :rate 44100.0,
 :status #<Atom@68de4551: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/terpsichore-mono.wav",
 :args {},
 :name "terpsichore-mono.wav",
 :rate-scale 1.0,
 :duration 122.03247165532879,
 :n-samples 10763264}

{:id 12,
 :size 8138240,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4446018d: :live>,
 :path
 "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav",
 :args {},
 :name "goldberg-slow-mono.wav",
 :rate-scale 1.0,
 :duration 184.540589569161,
 :n-samples 8138240}

{:id 13,
 :size 7564032,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@5531d516: :live>,
 :path "/Users/b/Dropbox/AB-local/sc-sounds/full-time-mono.wav",
 :args {},
 :name "full-time-mono.wav",
 :rate-scale 1.0,
 :duration 171.52,
 :n-samples 7564032}

#+end_example


***** basic buffer-info                                         :buffer:info:
#+BEGIN_SRC clojure :results output
  (for [name [variation1 variation2 apotheose calliope coda yancey naissance pas-daction pas-deux polymnie terpsichore goldberg-slow irma]]
  (do  (pprint (buffer-info name)) (println name) (println)))

  ;; (buffer-info variation1)
  ;; (buffer-info variation2)
  ;; (buffer-info apotheose)
  ;; (buffer-info calliope)
  ;; (buffer-info coda)
  ;; (buffer-info yancey)
  ;; (buffer-info naissance)
  ;; (buffer-info pas-daction)
  ;; (buffer-info pas-deux)
  ;; (buffer-info polymnie)
  ;; (buffer-info terpsichore)

#+END_SRC

#+RESULTS:
#+begin_example
{:id 0,
 :size 7658496,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7658496,
 :rate-scale 1.0,
 :duration 173.66204081632654}
#<buffer[live]: apollo-variation1-mono.wav 173.662041s mono 0>

{:id 1,
 :size 7216896,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7216896,
 :rate-scale 1.0,
 :duration 163.64843537414967}
#<buffer[live]: apollo-variation2-mono.wav 163.648435s mono 1>

{:id 2,
 :size 8620032,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 8620032,
 :rate-scale 1.0,
 :duration 195.4655782312925}
#<buffer[live]: apotheose-mono.wav 195.465578s mono 2>

{:id 3,
 :size 4876288,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 4876288,
 :rate-scale 1.0,
 :duration 110.57342403628118}
#<buffer[live]: calliope-mono.wav 110.573424s mono 3>

{:id 4,
 :size 7805824,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7805824,
 :rate-scale 1.0,
 :duration 177.0028117913832}
#<buffer[live]: coda-mono.wav 177.002812s mono 4>

{:id 5,
 :size 12036573,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12036573,
 :rate-scale 1.0,
 :duration 272.9381632653061}
#<buffer[live]: how-long-slowest-mono.wav 272.938163s mono 5>

{:id 6,
 :size 12697600,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12697600,
 :rate-scale 1.0,
 :duration 287.9274376417234}
#<buffer[live]: naissance-mono.wav 287.927438s mono 6>

{:id 7,
 :size 12649472,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12649472,
 :rate-scale 1.0,
 :duration 286.8360997732426}
#<buffer[live]: pas-daction-real-mono.wav 286.836100s mono 7>

{:id 8,
 :size 10633344,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 10633344,
 :rate-scale 1.0,
 :duration 241.11891156462585}
#<buffer[live]: pas-de-deux-mono1.wav 241.118912s mono 8>

{:id 9,
 :size 3202816,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 3202816,
 :rate-scale 1.0,
 :duration 72.62621315192743}
#<buffer[live]: polymnie-mono.wav 72.626213s mono 9>

{:id 10,
 :size 5381632,
 :n-channels 2,
 :rate 44100.0,
 :n-samples 10763264,
 :rate-scale 1.0,
 :duration 122.03247165532879}
#<buffer[live]: terpsichore-mono.wav 122.032472s stereo 10>

{:id 11,
 :size 8138240,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 8138240,
 :rate-scale 1.0,
 :duration 184.540589569161}
#<buffer[live]: goldberg-slow-mono.wav 184.540590s mono 11>

{:id 12,
 :size 7564032,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7564032,
 :rate-scale 1.0,
 :duration 171.52}
#<buffer[live]: full-time-mono.wav 171.520000s mono 12>

#+end_example


*** monitor current state of refs
:PROPERTIES:
:ID:       119605DE-9AD4-4818-B921-3E6B76396D6C
:END:
#+BEGIN_SRC clojure
  (list 'Channel-one
        'KNOBS @cc1-1 @cc2-1 @cc3-1 @cc4-1 @cc5-1 @cc6-1 @cc7-1 @cc8-1
        'PADS @pad1-1 @pad2-1 @pad3-1 @pad4-1 @pad5-1 @pad6-1 @pad7-1 @pad8-1
        'Channel-two
        'KNOBS
        @cc1-2 @cc2-2 @cc3-2 @cc4-2 @cc5-2 @cc6-2 @cc7-2 @cc8-2
        'PADS @pad1-2 @pad2-2 @pad3-2 @pad4-2 @pad5-2 @pad6-2 @pad7-2 @pad8-2)
#+END_SRC

#+RESULTS:
| Channel-one | KNOBS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | PADS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | Channel-two | KNOBS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | PADS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |

*** record-val (to 'liked-values' ref); my maprange; round2; read-ugen

#+BEGIN_SRC clojure
  ;; hard codes in ref for "liked-values"
  (defn record-val [place]
    (swap! liked-values conj (deref place)))

(defn maprange [[a1 a2] [b1 b2] s]
	(+ b1 (/ (* (- s a1) (- b2 b1)) (- a2 a1))))

;; in more recent versions of overtone?
(defn round2
  "Round a double to the given precision (number of significant digits)"
  [precision d]
  (let [factor (Math/pow 10 precision)]
    (/ (Math/round (* d factor)) factor)))

(defmacro read-ugen [dur ugen]
`(run ~dur (poll:kr (impulse:kr 2) ~ugen)))
#+END_SRC

#+RESULTS:
: #'user/record-val#'user/maprange#'user/read-ugen


*** full knob and pad abstraction
:PROPERTIES:
:ID:       C945047A-E0FD-439C-9354-6F8CA4989DAE
:END:
#+BEGIN_SRC clojure
;;; N.B. passing in the buffer num isn't ideal!
  (defn reset-knob [synth buffer-num synth-param knob-number place midi-channel & {:keys [scale]
                                                                        :or {scale 1}}]
      (fn [{knob :note val :velocity chan :channel}]
        (if (= chan midi-channel)
          (cond (= knob knob-number)
                (do (reset! place (* val scale))
                    (ctl synth (keyword buffer) buffer-num (keyword synth-param) (deref place))
                    (println (str synth-param knob-number " : ") (deref place)))))))

#+END_SRC

#+RESULTS:
: #'user/reset-knob

#+BEGIN_SRC clojure
;;; N.B. passing in the buffer num isn't ideal!
  (defn swap-pad [synth buffer-num synth-param pad-number place swap-fn midi-channel]
      (fn [{pad :note val :velocity chan :channel}]
        (if (= chan midi-channel)
          (cond (= pad pad-number)
                (do (swap! place swap-fn)
                    (ctl synth (keyword buffer) buffer-num (keyword synth-param) (deref place))
                    (println (str synth-param pad-number " : ") (deref place)))))))
    
#+END_SRC

#+RESULTS:
: #'user/swap-pad


*** create synths

See granular synth defined for minilogue cc knobs
[[id:ABD50379-307B-44F0-BA31-7540257029DC][minilogue for grains]]

#+CALL: minirand-ccgrain-no-line()

#+BEGIN_SRC clojure :results silent
(def mini-obsessive (minirand-ccgrain-no-line 3))
#+END_SRC

#+BEGIN_SRC clojure :results silent
;; (cc-minilogue1-grains mini-obsessive ::obess)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(mini-scaling-test mini-obsessive ::mini-obsess)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::mini-obsess)
;; (remove-event-handler ::obess)
#+END_SRC


#+BEGIN_SRC clojure :results silent
(defsynth mini-filterable-synth
  [cc34 1
   cc35 1
   cc36 200]
  (out 0 (pan2 (* cc34 (resonz (brown-noise) cc36 cc35)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
 (def filterable-synth (mini-filterable-synth))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(mini-scaling-test filterable-synth ::mini-filt)
#+END_SRC

#+NAME: call-me-remote
#+begin_SRC clojure
(rand)
#+END_SRC

#+RESULTS: call-me-remote
: 0.9825551664091691

#+CALL: call-me-remote()

#+RESULTS:
: 0.3852873461500559

**** Yancey cc-knob functions (used by simple8)
#+BEGIN_SRC clojure :results silent
(defn cc-one [active-synth vel] (ctl active-synth :trate (scale-range vel 1 127 0.1 10)))
(defn cc-two [active-synth vel] (ctl active-synth :dur-numerator (scale-range vel 1 127 0.1 24)))
(defn cc-three [active-synth vel] (ctl active-synth :centerpos (scale-range vel 1 127 0 272)))
(defn cc-four [active-synth vel] (ctl active-synth :amp (scale-range vel 1 127 0 1)))
#+END_SRC

#+RESULTS:
: #'user/cc-one#'user/cc-two#'user/cc-three#'user/cc-four

**** Goldberg cc-knob functions (used by simple8)
#+BEGIN_SRC clojure :results silent

(defn cc-five [active-synth vel] (ctl active-synth :trate (scale-range vel 1 127 0.1 10)))
(defn cc-six [active-synth vel] (ctl active-synth :dur-numerator (scale-range vel 1 127 0.1 24)))
(defn cc-seven [active-synth vel] (ctl active-synth :centerpos (scale-range vel 1 127 0 184)))
(defn cc-eight [active-synth vel] (ctl active-synth :amp (scale-range vel 1 127 0 1)))

#+END_SRC

#+RESULTS:
: #'user/cc-five#'user/cc-six#'user/cc-seven#'user/cc-eight


** use "sample number" to move through centerpos values

#+BEGIN_SRC clojure :results silent
(defn swap-centerpos-in-samples-pad [active-synth1 active-synth2]
  (fn [{pad :note}]
    (case pad
      36 (do (swap! centerpos1 #(- % 100)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      37 (do (swap! centerpos1 #(- % 1000)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      38 (do (swap! centerpos2 #(- % 100)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      39 (do (swap! centerpos2 #(- % 1000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      40 (do (swap! centerpos1 #(+ % 100)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      41 (do (swap! centerpos1 #(+ % 1000)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      42 (do (swap! centerpos2 #(+ % 1000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      43 (do (swap! centerpos2 #(+ % 10000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(on-event [:midi :note-on]
          (swap-centerpos-in-samples-pad yancey-noline goldberg-noline)
          ::pad-control-yancey-centerpos-in-samples)
#+END_SRC

#+BEGIN_SRC clojure :results silent
;; (remove-event-handler ::pad-control-yancey-centerpos-in-samples)
#+END_SRC

#+BEGIN_SRC clojure
(list @centerpos1 @centerpos2)
#+END_SRC

#+RESULTS:
| 71300 | 7323600.1 |


** use mousex and y for non-MIDI controller interaction 
- Load up overtone and apollo samples

This uses mouse-x to change centerpos, which suggests you are actively
moving with a mouse (most convenient when working as laptop using
trackpad)

Note, these are DEFINST
#+BEGIN_SRC clojure :results output

  (definst grainy-ctl-mousex [b 0 trate 1 amp 0.8]
    (let [trate trate
	  dur (/ 2 trate)]
      (t-grains:ar 1 (impulse:ar trate) b 1 ;; mouse-x (no line/random)
		   (mouse-x:kr 0 (buf-dur:kr b)) dur
		   0 amp 2)))




#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :results silent
(def viol1 (grainy-ctl-mousex :b 1 :trate 0.25))
#+END_SRC

#+BEGIN_SRC clojure
(ctl grainy-ctl-mousex :trate 0.5)
#+END_SRC


#+BEGIN_SRC clojure :results output
  (definst mouse-grain-y [b 0 trate-mousey-min 1  dur-numerator 2]
    (let [trate (mouse-y:kr trate-mousey-min 16)
          dur (/ dur-numerator trate)]
      (t-grains:ar 1 (impulse:ar trate) b 1 ;; mouse x/y (no line/random)
                   (mouse-x:kr 0 (buf-dur:kr b)) dur 
                   0 0.8 2)))



#+END_SRC

#+RESULTS:
: Sending:  /g_new [47 1 31]
: Sending:  /sync [25]
: Sending:  /g_new [48 0 47]
: Sending:  /sync [26]
: Sending:  /g_new [49 1 47]
: Sending:  /sync [27]
: Sending:  /s_new [overtone.stu547/mono-inst-mixer 50 1 47 in-bus 18.0 out-bus 0.0 volume 1.0 pan 0.0]

: Sending:  /sync [28]

#+BEGIN_SRC clojure :results silent
  (mouse-grain-y 2 :dur-numerator 4)

;;  (ctl mouse-grain-y 2 :dur-numerator 2)
#+END_SRC
It would be nice to also have a way to mostly automate listening
behind the scenes with lines as centerpos and small mouse-x changes
for some parameter variation
*** making sin-osc FM noise (using ctl with many parameters)

 #+BEGIN_SRC clojure 
   ;; This buffer is for Clojure experiments and evaluation.
   ;; Press C-j to evaluate the last expression.
   (stop)

   (demo (rhpf (pan2 (* (lf-tri:kr 5) (lf-tri 220)))))

   (run 4 (poll:kr (impulse:kr 2) (line:kr 0 10 3 INF)))
   (run 20 (poll:kr (impulse:kr 2) (phasor:kr :start 0 :end 10)))
   (node? "Overtone Root")

   (group-deep-clear 34)
   (foundation-overtone-group)
   (kill-server)
   (boot-server)

   (overtone.repl.ugens/find-ugen)

 #+END_SRC

 #+BEGIN_SRC clojure
   (defsynth running [freq 1000 amp 0.5 w 100 x 10 y1 1 y2 1 z 0.1]
     (out 0 (rlpf (sin-osc (* freq (phasor:kr (impulse:kr y1) y2 0 x))))))

   (def the-tunes (running))

#+END_SRC

#+RESULTS:
: #<synth: running>#'user/the-tunes

#+BEGIN_SRC clojure
   (ctl the-tunes :y1 0)
#+END_SRC

#+RESULTS:
: #<synth-node[live]: user/running 36>

#+BEGIN_SRC clojure
   (on-event [:midi :control-change]
             (fn [{cc-channel :note vel :velocity}]
               (cond (= cc-channel 1) (ctl the-tunes :freq (scale-range vel 1 127 0.1 1000))
                     (= cc-channel 2) (ctl the-tunes :y1 (scale-range vel 1 127 0.1 20))
                     (= cc-channel 3) (ctl the-tunes :y2 (scale-range vel 1 127 0.1 30))))
             ::the-tunes-control)



   (remove-event-handler ::the-tunes-control)

 #+END_SRC

*** pulse-divider use
#+BEGIN_SRC clojure
  (defsynth env-tunes [freq 300 amp 1]
    (out 0 (* amp
              (env-gen (lin 0.4 1 0.4 0.5) 1 1 0 2)
              (+ (sin-osc (/ freq 2))
                 (rlpf (saw freq) (* 1.1 freq) 0.4)))))

  (def check-env-tunes (env-tunes))


  (ctl check-env-tunes :freq 400)


#+END_SRC

#+BEGIN_SRC clojure
(demo 10
        (let [src1      (sin-osc 440)
              src2      (sin-osc 880)
              root-trig (impulse:kr 10)
              t1        (pulse-divider:kr root-trig 20)
              t2        (pulse-divider:kr root-trig 10)]
          (* 100
             (+ (* (decay t1 0.1) src1)
                (* (decay t2 0.1) src2)))))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: quilbabel.core/audition-synth 46>

#+BEGIN_SRC clojure :results silent
  (demo 10 (sin-osc (+ 1000 (* 600 (lf-noise0:kr 12))) 0.3))
#+END_SRC

*** ring modulation with resonz examples
 #+BEGIN_SRC clojure
 ;;(demo 10 (ring1 (* 0.4 (rlpf (resonz (saw) 1000 ) 1000 10)) (* 3 (lf-noise0 30))))
 (demo 30 (ring3 (* 100 (rlpf (resonz (saw) 100 ) 1000 10)) (* 3 (lf-noise0 100))))
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: quilbabel.core/audition-synth 49>

*** a many parametered inst template (for ring modulation experiment)

 #+BEGIN_SRC clojure
 (definst d1 [param1 10 param2 100 param3 1000 param4 10 param5 100] (ring3 (* param1 (rlpf (resonz (saw) param2 ) param3 10)) (* param4 (lf-noise0 param5))))
 #+END_SRC


    #+RESULTS:
    : #<instrument: d1>

 #+BEGIN_SRC clojure
 (kill my-d1)
 #+END_SRC

 #+RESULTS:
 : nil

 #+BEGIN_SRC clojure
 (def my-d1 (d1))
 #+END_SRC

 #+RESULTS:
 : #'user/my-d1

 #+BEGIN_SRC clojure
 (ctl my-d1 :param1 20 :param2 50 :param3 400 :param4 10 :param5 10)
 #+END_SRC

 #+RESULTS:
 : #<synth-node[live]: user/d1 53>

#+NAME: list-all-cc
 #+BEGIN_SRC clojure
   (on-event [:midi :control-change]
             (fn [{cc-channel :note vel :velocity chan :channel}]
	       (println (list cc-channel vel chan)))
	       ::list-all)
 #+END_SRC

 #+RESULTS: list-all-cc
 : :added-async-handler

#+NAME: list-all-cc-remove
 #+BEGIN_SRC clojure :results silent
 (remove-event-handler ::list-all)
 #+END_SRC

#+BEGIN_SRC clojure :results silent
   (on-event [:midi :note-on]
             (fn [{cc-channel :note vel :velocity chan :channel}]
	       (println (list cc-channel vel chan)))
	       ::list-all-notes)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::list-all-notes)
#+END_SRC
**** why providing values to demo cause problems?? why?
 #+BEGIN_SRC clojure :results silent
 (let [track-length 30 seconds-duration (reciprocal track-length) ]
   (demo seconds-duration
         (pan2 (bpf (pink-noise)
                    (phasor:kr (impulse:kr seconds-duration) seconds-duration 100 1000 100)))))

 #+END_SRC

 #+BEGIN_SRC clojure
 (let [track-length 10
       per-second (reciprocal track-length)]
   (run (poll:kr (impulse:kr track-length)
                 (phasor:kr (impulse:kr per-second) per-second 100 1000 100))))
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: user/audition-synth 54>

 #+BEGIN_SRC clojure
 (let [track-length 10
       per-second (reciprocal track-length)]
   (demo track-length (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr per-second) per-second 100 1000 100)))))
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC clojure :results silent
   (demo 30 (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100))))
 #+END_SRC

 #+BEGIN_SRC clojure :results silent
 (let [track-length 30
       every-x-seconds (reciprocal track-length)]
   (demo track-length (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100)))))
 #+END_SRC

 #+BEGIN_SRC clojure :results silent
 (let [x 30
 ;;      y (reciprocal x)
 ]
   (demo 30 (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100)))))
 #+END_SRC

**** re-bind demo-time how?
 dynamically in a let yeah? use =binding= form as per Emerick?

 #+BEGIN_SRC clojure :results silent
 (let [*demo-time* 100] 
   (demo (sin-osc)))
 #+END_SRC


 #+BEGIN_SRC clojure :results output
 (let [*demo-time* 100 
       _ (println *demo-time*)
       _ (demo (sin-osc))])
 #+END_SRC

 #+RESULTS:
 : 100

 #+BEGIN_SRC clojure :results output

 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC clojure :results silent
 (let [x 30
 *demo-time* (* x 1000)
       y (reciprocal x)
 ]
   (demo (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr y) y 100 1000 100)))))
 #+END_SRC

*** create the macro!
    :PROPERTIES:
    :DATE_CREATED: [2017-03-03 Fri 09:50]
    :END:

First of all, prefer =case= to =cond=
#+BEGIN_SRC clojure
;;       16 (ctl active-synth :room16 (scale-range vel 1 127 0.1 10))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(= cc-channel 5) 
(do (reset! instrument1-cc0-1-lo (scale-range vel 1 127 rlolo-1 rlohi-1))
    (reset! instrument1-cc0-2-lo (scale-range vel 1 127 rlolo-2 rlohi-2))
    (println (str @instrument1-cc0-1-lo) (str @instrument1-cc0-2-lo)))
#+END_SRC


#+NAME: cc-knob-scale-range-macro
#+BEGIN_SRC clojure :results silent
(defmacro test [active-synth cc-knob tar-lo tar-hi vel]
  `(ctl ~active-synth ~cc-knob (scale-range ~vel 1 127 ~tar-lo ~tar-hi)))
#+END_SRC

#+BEGIN_SRC clojure
(macroexpand-1 '(test sympth :cc0-1 0 100))
#+END_SRC

#+RESULTS:
| overtone.live/ctl | sympth | :cc0-1 | (overtone.live/scale-range user/vel 1 127 0 100) |

#+BEGIN_SRC clojure
(defn simple-test [active-synth double-colon-name]
  (on-event
   [:midi :control-change]
   (fn [{cc-channel :note vel :velocity}]
     (case cc-channel
       1 (test active-synth :cc0-1 0 100 vel)
       2 (test active-synth :cc0-2 0 100 vel)
       3 (test active-synth :cc0-3 0 100 vel)
       4 (test active-synth :cc0-4 0 100 vel)
       5 (test active-synth :cc0-5 0 100 vel)
       6 (test active-synth :cc0-6 0 100 vel)
       7 (test active-synth :cc0-7 0 100 vel)
       8 (test active-synth :cc0-8 0 100 vel)
       ))
   double-colon-name))
#+END_SRC

#+RESULTS:
: #'user/simple-test

#+BEGIN_SRC clojure :results silent
(simple-test filterable-background ::simple-test-handler)
#+END_SRC

